Podkova/src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>CatalogRef.УчетныеПолитикиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ВедетсяУчетПостоянныхИВременныхРазниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСНДоходыМинусРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяПСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/УчетнаяПолитикаОрганизаций/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	// Заполним ресурсы регистра, кэшируемые из справочника учетной политики.
	КэшПараметровПоОрганизациям = Новый Соответствие;
	
	Для Каждого ТекСтр Из ЭтотОбъект Цикл
		
		ПараметрыУчетнойПолитики = Неопределено;
		ДанныеКэша = КэшПараметровПоОрганизациям.Получить(ТекСтр.Организация);
		
		Если ДанныеКэша <> Неопределено Тогда
			
			ПараметрыУчетнойПолитики = ДанныеКэша.Получить(ТекСтр.УчетнаяПолитика);
			
			Если ПараметрыУчетнойПолитики = Неопределено Тогда
				
				ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.СформироватьКэшируемыеПараметрыУчетнойПолитики(
					ТекСтр.УчетнаяПолитика,
					ТекСтр.Организация);
				
				КэшПараметровПоОрганизациям[ТекСтр.Организация].Вставить(ТекСтр.УчетнаяПолитика, ПараметрыУчетнойПолитики);
				
			КонецЕсли;
			
		Иначе
			
			КэшПараметровПоОрганизациям.Вставить(
				ТекСтр.Организация,
				Новый Соответствие);
				
			ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.СформироватьКэшируемыеПараметрыУчетнойПолитики(
				ТекСтр.УчетнаяПолитика,
				ТекСтр.Организация);
				
			КэшПараметровПоОрганизациям[ТекСтр.Организация].Вставить(ТекСтр.УчетнаяПолитика, ПараметрыУчетнойПолитики);
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекСтр, ПараметрыУчетнойПолитики);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УточняемыеДанные.Период КАК Период,
	|	УточняемыеДанные.Организация КАК Организация,
	|	УточняемыеДанные.УчетнаяПолитика КАК УчетнаяПолитика,
	|	УточняемыеДанные.ПлательщикЕНВД КАК ПлательщикЕНВД,
	|	УточняемыеДанные.ПлательщикНалогаНаПрибыль КАК ПлательщикНалогаНаПрибыль,
	|	УточняемыеДанные.ПрименяетсяУСН КАК ПрименяетсяУСН,
	|	УточняемыеДанные.ПрименяетсяУСНДоходыМинусРасходы КАК ПрименяетсяУСНДоходыМинусРасходы,
	|	УточняемыеДанные.ВедетсяУчетПостоянныхИВременныхРазниц КАК ВедетсяУчетПостоянныхИВременныхРазниц
	|ПОМЕСТИТЬ ВТНовыеДанные
	|ИЗ
	|	&Данные КАК УточняемыеДанные
	|";
	
	Запрос.УстановитьПараметр("Данные", ЭтотОбъект.Выгрузить());
	Запрос.Выполнить(); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НовыеДанные.Период КАК Период,
	|	Организации.Ссылка КАК Организация,
	|	НовыеДанные.УчетнаяПолитика КАК УчетнаяПолитика,
	|	НовыеДанные.ПлательщикЕНВД КАК ПлательщикЕНВД,
	|	НовыеДанные.ПлательщикНалогаНаПрибыль КАК ПлательщикНалогаНаПрибыль,
	|	НовыеДанные.ПрименяетсяУСН КАК ПрименяетсяУСН,
	|	НовыеДанные.ПрименяетсяУСНДоходыМинусРасходы КАК ПрименяетсяУСНДоходыМинусРасходы,
	|	НовыеДанные.ВедетсяУчетПостоянныхИВременныхРазниц
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНовыеДанные КАК НовыеДанные
	|		ПО Организации.Ссылка.ГоловнаяОрганизация = НовыеДанные.Организация
	|ГДЕ
	|	Организации.Ссылка <> Организации.ГоловнаяОрганизация
	|	И Организации.ГоловнаяОрганизация В
	|			(ВЫБРАТЬ
	|				Организации.Организация
	|			ИЗ
	|				ВТНовыеДанные КАК Организации
	|			ГДЕ
	|				Организации.Организация = Организации.Организация.ГоловнаяОрганизация)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),Выборка);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#КонецЕсли
